src/cf/InformationRegisters/ДокументыФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДокументыФизическихЛиц</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КемВыдан</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПодразделения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЯвляетсяДокументомУдостоверяющимЛичность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Физлицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументовФизическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/ПолФизическогоЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ПолФизическогоЛица</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Мужской</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Женский</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ЮридическоеФизическоеЛицо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЮридическоеФизическоеЛицо</Name>
			<Comment>Определяет, является ли организация или контрагент юридическим лицом или нет.</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮридическоеЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФизическоеЛицо</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/ВидыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ВидыКонтактнойИнформации</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВводитьНомерПоМаске</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключатьСтрануВПредставление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПоляДругое</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРедактирования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретитьРедактированиеПользователем</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторДляФормул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяГруппы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПредопределенногоВида</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Используется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсправлятьУстаревшиеАдреса</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаскаНомераТелефона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МеждународныйФорматАдреса</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МожноИзменятьСпособРедактирования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбязательноеЗаполнение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверятьКорректность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПроверятьПоФИАС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешитьВводНесколькихЗначений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкрыватьНеактуальныеАдреса</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелефонСДобавочнымНомером</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоНациональныйАдрес</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьРедактированиеТолькоВДиалоге</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УказыватьОКТМО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранитьИсториюИзменений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтображатьВсегда</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Представления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодЯзыка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/CommonModules/МашиночитаемыеДоверенностиФНСПереопределяемый/Ext/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2024, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// При заполнении налоговых органов действия.
// 
// Параметры:
//  Организации - Массив, Неопределено
//  НалоговыеОрганыДействия - ТаблицаЗначений
//
Процедура ПриЗаполненииНалоговыхОргановДействия(Организации, НалоговыеОрганыДействия) Экспорт
		
КонецПроцедуры

// Вызывается в форме машиночитаемой доверенности для заполнения реквизитов организации при выборе доверителя и представителя,
// если выбран вид представителя/доверителя "Организация".
// 
// Параметры:
//  Организация - ОпределяемыйТип.Организация - ссылка на организацию, реквизиты которой надо заполнить.
//  Реквизиты - Структура:
//                * ЭтоИндивидуальныйПредприниматель - Булево
//                * ЭтоИностраннаяОрганизация - Булево
//                * ЭтоФилиал - Булево
//                * НаименованиеПолное - Строка
//                * НаименованиеСокращенное - Строка
//                * ИНН - Строка
//                * КПП - Строка
//                * ОГРН - Строка
//                * ЭлектроннаяПочта - Строка
//                * ЭлектроннаяПочтаЗначение - Строка - в формате JSON, как его возвращает
//                  функция КонтактнаяИнформацияОбъекта общего модуля УправлениеКонтактнойИнформацией.
//                * Телефон - Строка
//                * ТелефонЗначение - Строка - в формате JSON, как его возвращает
//                  функция КонтактнаяИнформацияОбъекта общего модуля УправлениеКонтактнойИнформацией.
//                Заполняются для иностранной организации:
//                * НомерЗаписиОбАккредитации - Строка
//                * СтранаРегистрации - СправочникСсылка.СтраныМира
//                * СтранаРегистрацииКод - Строка
//                * РегистрационныйНомерВСтранеРегистрации - Строка
//                * НаименованиеРегистрирующегоОргана - Строка
//                * КодНалогоплательщикаВСтранеРегистрации - Строка
//                * ФактическийАдрес - Строка
//                * ФактическийАдресЗначение - Строка - в формате JSON, как его возвращает
//                  функция КонтактнаяИнформацияОбъекта общего модуля УправлениеКонтактнойИнформацией.
//                * ЮридическийАдресВСтранеРегистрации - Строка
//                * ЮридическийАдресВСтранеРегистрацииЗначение - Строка - в формате JSON, как его возвращает
//                  функция КонтактнаяИнформацияОбъекта общего модуля УправлениеКонтактнойИнформацией.
//                Заполняются для российской организации:
//                * НаименованиеУчредительногоДокумента - Строка
//                * ЮридическийАдрес - Строка
//                * ЮридическийАдресЗначение - Строка - в формате JSON, как его возвращает
//                  функция КонтактнаяИнформацияОбъекта общего модуля УправлениеКонтактнойИнформацией.
//                Заполняются для филиала:
//                * РегистрационныйНомерФилиала - Строка
//                Данные о физическом лице с правом действия без доверенности:
//                * ЛицоБезДоверенности - ОпределяемыйТип.ФизическоеЛицо
//                * РеквизитыЛицаБезДоверенности - см. ПриЗаполненииРеквизитовФизическогоЛица.Реквизиты
//
//  СтандартнаяОбработка - Булево - установите в Ложь, если нужно отменить заполнение реквизитов из подсистемы Организации
//
Процедура ПриЗаполненииРеквизитовОрганизации(Организация, Реквизиты, СтандартнаяОбработка) Экспорт
	
	// {УАТ}
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Организация) <> Тип("СправочникСсылка.Организации") Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеОрганизации = Новый Структура();
	уатОбменСГИСЭПД.ПолучитьРегистрационныеДанныеОрганизации(Организация, Реквизиты);
	
	Реквизиты.НаименованиеПолное = Реквизиты.Наименование;
	
	ОтборКонтактнойИнформации = УправлениеКонтактнойИнформацией.ОтборКонтактнойИнформации();
	ОтборКонтактнойИнформации.Дата = ТекущаяДатаСеанса();
	
	КИОрганизации = УправлениеКонтактнойИнформацией.КонтактнаяИнформация(Организация, ОтборКонтактнойИнформации);
	НайденныеСтроки = КИОрганизации.НайтиСтроки(Новый Структура("Вид", Справочники.ВидыКонтактнойИнформации.EmailОрганизации));
	Если НайденныеСтроки.Количество() > 0 Тогда
		Реквизиты.ЭлектроннаяПочта = НайденныеСтроки[0].Представление;
		Реквизиты.ЭлектроннаяПочтаЗначение = НайденныеСтроки[0].Значение;
	КонецЕсли;
	
	НайденныеСтроки = КИОрганизации.НайтиСтроки(Новый Структура("Вид", Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации));
	Если НайденныеСтроки.Количество() > 0 Тогда
		Реквизиты.ЮридическийАдрес = НайденныеСтроки[0].Представление;
		Реквизиты.ЮридическийАдресЗначение = НайденныеСтроки[0].Значение;
	КонецЕсли;
	
	НайденныеСтроки = КИОрганизации.НайтиСтроки(Новый Структура("Вид", Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации));
	Если НайденныеСтроки.Количество() > 0 Тогда
		Реквизиты.Телефон = НайденныеСтроки[0].Представление;
		Реквизиты.ТелефонЗначение = НайденныеСтроки[0].Значение;
	КонецЕсли;
	// {/УАТ}
	
КонецПроцедуры

// Вызывается в форме машиночитаемой доверенности для заполнения реквизитов физического лица при выборе доверителя и представителя,
// если выбран вид представителя/доверителя "Физическое лицо".
// 
// Параметры:
//  ФизическоеЛицо - ОпределяемыйТип.ФизическоеЛицо - ссылка на физлицо, реквизиты которого надо заполнить.
//  Реквизиты - Структура:
//               * ЭтоИндивидуальныйПредприниматель - Булево
//               * ЭтоФизическоеЛицо - Булево
//               * ЭтоДолжностноеЛицо - Булево
//               * ДолжностьЛицаДоверителя - Строка
//               * Фамилия - Строка
//               * Имя - Строка
//               * Отчество - Строка
//               * Пол - Число - 1 - мужской, 2 - женский
//               * ИННФЛ - Строка
//               * СтраховойНомерПФР - Строка
//               * АдресРегистрации - Строка
//               * АдресРегистрацииЗначение - Строка - в формате JSON, как его возвращает
//                  функция КонтактнаяИнформацияОбъекта общего модуля УправлениеКонтактнойИнформацией.
//               * ЭлектроннаяПочта - Строка
//               * ЭлектроннаяПочтаЗначение - Строка - в формате JSON, как его возвращает
//                  функция КонтактнаяИнформацияОбъекта общего модуля УправлениеКонтактнойИнформацией.
//               * Телефон - Строка
//               * ТелефонЗначение - Строка - в формате JSON, как его возвращает
//                  функция КонтактнаяИнформацияОбъекта общего модуля УправлениеКонтактнойИнформацией.
//               * ДатаРождения - Дата
//               * ДокументВид - Строка
//               * ДокументНомер - Строка
//               * ДокументКемВыдан - Строка
//               * ДокументДатаВыдачи - Дата
//               * ДокументКодПодразделения - Строка - код подразделения в виде 999-999
//               * ДокументСрокДействия - Дата
//               * Гражданство - СправочникСсылка.СтраныМира
//               * БезГражданства - Булево
//               * МестоРождения - Строка
//               * НомерЗаписиЕдиногоРегистраНаселения - Строка
//
Процедура ПриЗаполненииРеквизитовФизическогоЛица(ФизическоеЛицо, Реквизиты) Экспорт
	
	// {УАТ}
	Если НЕ ЗначениеЗаполнено(ФизическоеЛицо) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ФизическоеЛицо) <> Тип("СправочникСсылка.ФизическиеЛица") Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураДанных = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ФизическоеЛицо, "ДатаРождения, ИНН, Пол, ФИО, СтраховойНомерПФР");
	ЗаполнитьЗначенияСвойств(Реквизиты, ФизическиеЛицаКлиентСервер.ЧастиИмени(СтруктураДанных.ФИО));
	
	Реквизиты.ДатаРождения  = СтруктураДанных.ДатаРождения;
	Реквизиты.ИННФЛ         = СтруктураДанных.ИНН; 
	Если СтруктураДанных.Пол = Перечисления.ПолФизическогоЛица.Мужской Тогда
		Реквизиты.Пол = 1;
	ИначеЕсли СтруктураДанных.Пол = Перечисления.ПолФизическогоЛица.Женский Тогда
		Реквизиты.Пол = 2;
	КонецЕсли;
	Реквизиты.СтраховойНомерПФР = СтруктураДанных.СтраховойНомерПФР;
	Реквизиты.БезГражданства    = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Физлицо",	ФизическоеЛицо);
	Запрос.УстановитьПараметр("ДатаСреза",	ТекущаяДатаСеанса());
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ДокументыФизическихЛиц.Представление КАК Представление,
	|	ДокументыФизическихЛиц.ВидДокумента КАК ВидДокумента,
	|	ДокументыФизическихЛиц.Серия КАК Серия,
	|	ДокументыФизическихЛиц.Номер КАК Номер,
	|	ДокументыФизическихЛиц.ДатаВыдачи КАК ДатаВыдачи,
	|	ДокументыФизическихЛиц.СрокДействия КАК СрокДействия,
	|	ДокументыФизическихЛиц.КемВыдан КАК КемВыдан,
	|	ДокументыФизическихЛиц.КодПодразделения КАК КодПодразделения
	|ИЗ
	|	РегистрСведений.ДокументыФизическихЛиц КАК ДокументыФизическихЛиц
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			МАКСИМУМ(ДокументыФизическихЛиц.Период) КАК Период,
	|			ДокументыФизическихЛиц.Физлицо КАК Физлицо
	|		ИЗ
	|			РегистрСведений.ДокументыФизическихЛиц КАК ДокументыФизическихЛиц
	|		ГДЕ
	|			ДокументыФизическихЛиц.ЯвляетсяДокументомУдостоверяющимЛичность
	|			И ДокументыФизическихЛиц.Физлицо = &Физлицо
	|			И ДокументыФизическихЛиц.Период <= &ДатаСреза
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ДокументыФизическихЛиц.Физлицо) КАК ДокументыСрез
	|		ПО ДокументыФизическихЛиц.Период = ДокументыСрез.Период
	|			И ДокументыФизическихЛиц.Физлицо = ДокументыСрез.Физлицо
	|			И (ДокументыФизическихЛиц.ЯвляетсяДокументомУдостоверяющимЛичность)";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если ЗначениеЗаполнено(Выборка.ВидДокумента) Тогда
			Реквизиты.ДокументВид = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Выборка.ВидДокумента, "КодМВД");
		КонецЕсли;
		Реквизиты.ДокументНомер            = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1 %2'; en = '%1 %2'"), Выборка.Серия, Выборка.Номер);
		Реквизиты.ДокументКемВыдан         = Выборка.КемВыдан;
		Реквизиты.ДокументКодПодразделения = Выборка.КодПодразделения;
		Реквизиты.ДокументДатаВыдачи       = Выборка.ДатаВыдачи
	КонецЕсли;
	
	АдресаЭлектроннойПочты = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(
		ФизическоеЛицо, Справочники.ВидыКонтактнойИнформации.EmailФизЛица, , Ложь);
	
	Если ЗначениеЗаполнено(АдресаЭлектроннойПочты) Тогда
		АдресЭлектроннойПочты = АдресаЭлектроннойПочты[0];
		Реквизиты.ЭлектроннаяПочтаЗначение = АдресЭлектроннойПочты.Значение;
		Реквизиты.ЭлектроннаяПочта = АдресЭлектроннойПочты.Представление;
	КонецЕсли;

	Телефоны = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ФизическоеЛицо, 
	Справочники.ВидыКонтактнойИнформации.ТелефонРабочийФизическиеЛица,,
	Ложь);
	
	Если ЗначениеЗаполнено(Телефоны) Тогда
		Телефон = Телефоны[0];  
		Реквизиты.ТелефонЗначение = Телефон.Значение;
		Реквизиты.Телефон         = Телефон.Представление;
	КонецЕсли;
	
	АдресаРегистрации = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(
	ФизическоеЛицо, Справочники.ВидыКонтактнойИнформации.АдресПоПропискеФизическиеЛица, , Ложь);
	
	Если ЗначениеЗаполнено(АдресаРегистрации) Тогда
		АдресРегистрации = АдресаРегистрации[0];
		Реквизиты.АдресРегистрацииЗначение = АдресРегистрации.Значение;
		Реквизиты.АдресРегистрации = АдресРегистрации.Представление;
	КонецЕсли;
	// {/УАТ}
	
КонецПроцедуры

// Вызывается в форме машиночитаемой доверенности для заполнения реквизитов контрагента при выборе доверителя и представителя,
// если выбран вид представителя/доверителя "Контрагент".
// 
// Параметры:
//  Контрагент - ОпределяемыйТип.Контрагент - ссылка на контрагента, реквизиты которого надо заполнить.
//  Реквизиты - см. ПриЗаполненииРеквизитовОрганизации.Реквизиты
//
Процедура ПриЗаполненииРеквизитовКонтрагента(Контрагент, Реквизиты) Экспорт
	
	// {УАТ}
	Если Не ЗначениеЗаполнено(Контрагент) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Контрагент) <> Тип("СправочникСсылка.Контрагенты") Тогда
		Возврат;
	КонецЕсли;
	
	СведенияОКонтрагенте = уатОбменСКонтрагентами.ПолучитьДанныеЮрФизЛица(Контрагент);

	РеквизитыКонтрагента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Контрагент, 
	"ГоловнойКонтрагент");
	
	Реквизиты.НаименованиеСокращенное = СведенияОКонтрагенте.СокращенноеНаименование;
	Реквизиты.НаименованиеПолное = СведенияОКонтрагенте.ПолноеНаименование;
	Реквизиты.ЭтоИндивидуальныйПредприниматель = 
	СведенияОКонтрагенте.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо;
	
	Реквизиты.ЭтоФилиал = ЗначениеЗаполнено(РеквизитыКонтрагента.ГоловнойКонтрагент)
	И РеквизитыКонтрагента.ГоловнойКонтрагент <> Контрагент;
	
	Реквизиты.СтранаРегистрации = СведенияОКонтрагенте.СтранаРегистрации;
	
	Если СведенияОКонтрагенте.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо Тогда
		Реквизиты.КПП = СведенияОКонтрагенте.КПП;
	КонецЕсли;
	
	Реквизиты.ИНН  = СведенияОКонтрагенте.ИНН;
	Реквизиты.ОГРН = СведенияОКонтрагенте.ОГРН;
	
	ОтборКонтактнойИнформации = УправлениеКонтактнойИнформацией.ОтборКонтактнойИнформации();
	ОтборКонтактнойИнформации.Дата = ТекущаяДатаСеанса();

	КИКонтрагента = УправлениеКонтактнойИнформацией.КонтактнаяИнформация(Контрагент, ОтборКонтактнойИнформации);
	НайденныеСтроки = КИКонтрагента.НайтиСтроки(Новый Структура("Вид", Справочники.ВидыКонтактнойИнформации.EmailКонтрагента));
	Если НайденныеСтроки.Количество() > 0 Тогда
		Реквизиты.ЭлектроннаяПочта = НайденныеСтроки[0].Представление;
		Реквизиты.ЭлектроннаяПочтаЗначение = НайденныеСтроки[0].Значение;
	КонецЕсли;
	
	НайденныеСтроки = КИКонтрагента.НайтиСтроки(Новый Структура("Вид", Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента));
	Если НайденныеСтроки.Количество() > 0 Тогда
		Реквизиты.ЮридическийАдрес = НайденныеСтроки[0].Представление;
		Реквизиты.ЮридическийАдресЗначение = НайденныеСтроки[0].Значение;
	КонецЕсли;
	
	НайденныеСтроки = КИКонтрагента.НайтиСтроки(Новый Структура("Вид", Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента));
	Если НайденныеСтроки.Количество() > 0 Тогда
		Реквизиты.Телефон = НайденныеСтроки[0].Представление;
		Реквизиты.ТелефонЗначение = НайденныеСтроки[0].Значение;
	КонецЕсли;
	// {/УАТ}
	
КонецПроцедуры

// Для выполнения прикладной проверки подписи по доверенности. Например, проверка соответствия реквизитов доверителя
// контрагенту, указанному в документе, и полномочий подписанта. Результаты проверки сохраняются в информационной базе.
//
// Параметры:
//  ДанныеДоверенности - Структура, ВыборкаИзРезультатаЗапроса:
//   * Ссылка - СправочникСсылка.МашиночитаемыеДоверенности
//   * ПодписанныйОбъект - ОпределяемыйТип.ПодписанныйОбъект - ссылка на подписанный объект.
//   * Полномочия - ТаблицаЗначений,  РезультатЗапроса - содержит реквизиты табличной части Полномочия справочника МашиночитаемыеДоверенности.
//   * Ограничения - ТаблицаЗначений, РезультатЗапроса - содержит реквизиты табличной части Ограничения справочника МашиночитаемыеДоверенности.
//  Сертификат - см. МашиночитаемыеДоверенностиФНС.ОтборДляДоверенностейПоСертификату.Сертификат
//  ПротоколПроверки - Соответствие из КлючИЗначение:
//   * Ключ - Строка - ключ проверки, для проверки полномочий и документа в протокол добавлены значения
//     с ключами "ПроверкаПолномочий" и "ПроверкаДокумента".
//   * Значение - см. МашиночитаемыеДоверенностиФНС.РезультатПроверкиДляПротокола
//
Процедура ПриПроверкеДоверенностиПодписи(ДанныеДоверенности, Сертификат, ПротоколПроверки) Экспорт
	
	
	
КонецПроцедуры

// Переопределяет описание состояния доверенности в реестре Федеральной таможенной службы или другом.
// 
// Параметры:
//  Доверенность - СправочникСсылка.МашиночитаемыеДоверенности
//  РегистрацияВРеестре - Структура:
//   * ПоказыватьРегистрироватьВРеестре - Булево - показывать флажок регистрации в реестре.
//   * ЗаголовокФлажкаРегистрации - Строка - заголовок флажка регистрации в реестре.
//   * ПодсказкаРегистрации - Строка - подсказка флажка регистрации.
//   * ЗарегистрированаВРеестре - Неопределено, Булево - признак необходимости регистрации в реестре.
//      Если указано Неопределено, требуется заполнить, если Булево - запомнить.
//   * СостояниеРегистрации - Строка, ФорматированнаяСтрока
//   * ПодсказкаСостояния - Строка - подсказка состояния регистрации. 
//   * Картинка - Строка - имя картинки статуса в строке состояния.
//   * ПолномочияПриОткрытии - Неопределено, Массив из Строка - список кодов полномочий, переданных в параметре при открытии
//     формы. Можно анализировать и не отображать флажок регистрации, если полномочия относятся к другой подсистеме.
//   * ВыбранныеПолномочия - Структура:
//     ** Полномочия -  ТаблицаЗначений
//     ** Ограничения - ТаблицаЗначений
//   * КодыПолномочийДляДобавления - Массив из Строка - коды полномочий, которые предлагать добавить при выборе флажка регистрации.
//     Если одно из них уже выбрано, предложение о добавлении не выводится.
//
Процедура ПриПолученииСтатусаРегистрации(Доверенность, РегистрацияВРеестре) Экспорт
	
	
	
КонецПроцедуры

// Переопределяет процедуру регистрации в реестре Федеральной таможенной службы или другом.
// 
// Параметры:
//  Доверенность - СправочникСсылка.МашиночитаемыеДоверенности
//
Процедура ПриРегистрацииДоверенности(Доверенность) Экспорт
	
	
	
КонецПроцедуры

// Переопределяет процедуру настроек формы списка для реестра Федеральной таможенной службы или другого.
// 
// Параметры:
//  Настройки - Структура:
//   * ПоказыватьСтатусВФормеСписка - Булево - показывать статус в реестре в форме списка.
//   * ЗаголовокКолонкиСтатуса      - Строка - заголовок колонки статуса в форме списка.
//   * КартинкаКолонкиСтатуса       - Картинка - картинка колонки статуса в форме списка.
//   * КоллекцияКартинокДляСтроки   - Картинка - коллекция для картинки строки.
//
Процедура ПриОпределенииНастроек(Настройки) Экспорт
	
	
	
КонецПроцедуры

// Переопределяет процедуру получения статусов доверенностей для реестра Федеральной таможенной службы или другого.
// 
// Параметры:
//  Доверенности - Массив из СправочникСсылка.МашиночитаемыеДоверенности
//  Статусы - Соответствие из КлючИЗначение:
//   * Ключ     - СправочникСсылка.МашиночитаемыеДоверенности
//   * Значение - Структура:
//                 ** ИндексКартинки - Число - картинка колонки статуса в форме списка.
//                 ** Статус         - Строка
//
Процедура ПриПолученииСтатусов(Доверенности, Статусы) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти
